Revit 2026 API

# TilePatternTileFailures Properties

---

The BuiltInFailuresTilePatternTileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TilePatternTile_InvalidFamily | Family not appropriate for Divided Surface component. |

#### Reference

BuiltInFailuresTilePatternTileFailures Class

Autodesk.Revit.DB Namespace